Revit 2026 API

# ChangeType Class

---

A class representing a change that can be detected and tracked during Dynamic Update.

SystemObject Autodesk.Revit.DBChangeType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ChangeType : IDisposable
```
```vb
Public Class ChangeType
	Implements IDisposable
```
```cpp
public ref class ChangeType : IDisposable
```
```fsharp
type ChangeType =
    class
        interface IDisposable
    end
```

The ChangeType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | ConcatenateChangeTypes | Creates a ChangeType that is a union of the two input ChangeTypes |
|  | Contains | Checks whether this ChangeType contains the input ChangeType |
|  | Dispose | Releases all resources used by the ChangeType |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsIdentical | Compares if two ChangeTypes are identical |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

ChangeTypes for specific changes can be obtained from the static methods available on Element.

#### Reference

Autodesk.Revit.DB Namespace